In [20]:
import pandas as pd

# Series

In [21]:
dataset = [2,4,6,8,10]

In [22]:
#Criando uma Series
serie = pd.Series(dataset)
serie

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [23]:
#Criando um indice diferente
index = [f'Linha {i}' for i in range(5)]
index

['Linha 0', 'Linha 1', 'Linha 2', 'Linha 3', 'Linha 4']

In [24]:
#Criando uma serie com o indice modificado
serie = pd.Series(dataset, index=index)
serie

Linha 0     2
Linha 1     4
Linha 2     6
Linha 3     8
Linha 4    10
dtype: int64

In [113]:
#Utilizando dicionarios paa criar dataframe
#dataset = {'Linha' + str(i) : i+1 for i in range(5)}
dataset = {f'Linha{i}' : i+1 for i in range(5)}
dataset

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [114]:
serie = pd.Series(dataset)
serie

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [115]:
serie1 = serie + 2
serie1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [116]:
serie2 = serie * serie1
serie2

Linha0     3
Linha1     8
Linha2    15
Linha3    24
Linha4    35
dtype: int64

# DataFrame

In [90]:
dataset = [ [1,2,3],
            [4,5,6],
            [7,8,9] ]
dataset

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [91]:
df1 = pd.DataFrame(dataset)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [92]:
index = [f'Linha{i}' for i in range(3)]
index

['Linha0', 'Linha1', 'Linha2']

In [93]:
df1 = pd.DataFrame(dataset, index=index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [94]:
columns = [f'Coluna{i}' for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [95]:
df1 = pd.DataFrame(dataset, index=index,columns=columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [97]:
df2 = pd.DataFrame(dataset, index=index,columns=columns)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [98]:
dataset = [ (1,2,3),
            (4,5,6),
            (7,8,9) ]
dataset

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [100]:
df3 = pd.DataFrame(dataset, index=index,columns=columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

## Concatenar DataFrames

In [101]:
#Trocar todos os elementos maiores q 0 por A 
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [102]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [103]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [107]:
#Concatena na Vertical
df4 = pd.concat([df1,df2,df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [106]:
#Concatena na Horizontal
#por causa do axis
df4 = pd.concat([df1,df2,df3], axis=1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C